backend/app/controllers/application_controller.rb

  def authenticate_user
    header = request.headers['Authorization']
    @current_user = nil
    return @current_user unless header

    token = header.split(' ').last
    return @current_user unless token

    begin
      decoded = JWT.decode(token, 'your-secret-key-here')[0]
      @current_user = User.find(decoded['user_id'])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (24, 25, 26, 27, 28)