backend/app/controllers/api/v1/auth_controller.rb

INSERT INTO `users` (`name`, `email`, `password_digest`, `created_at`, `updated_at`, `store_name`) VALUES ('Test User', 'test@example.com', '$2a$12$k5Dj6mX8K68KSawgvFsRauZTZ4.pKckWxnl9wpNBjxqM.zzgYi9yS', '2025-08-01 18:48:16.366313', '2025-08-01 18:48:16.366313', 'Test Store')
---
  def signup
    user = User.new(user_params)

    if user.save

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'admin@shopease.com' LIMIT 1
---
  def signin
    # Handle both formats: params[:user][:email] and params[:email]
    email = params.dig(:user, :email) || params[:email]
    password = params.dig(:user, :password) || params[:password]

    user = User.find_by(email: email)

UPDATE `users` SET `users`.`name` = 'Updated Admin Name', `users`.`updated_at` = '2025-08-02 09:23:26.126588', `users`.`store_name` = 'Updated Store' WHERE `users`.`id` = 23
---
  def profile
    require_authentication
    return if performed? # Stop execution if authentication failed

    if @current_user.update(profile_params)