backend/app/controllers/api/v1/notifications_controller.rb

SELECT `notifications`.* FROM `notifications` WHERE `notifications`.`user_id` = 23 ORDER BY `notifications`.`created_at` DESC
---
  def index
    @notifications = @current_user.notifications.order(created_at: :desc)