backend/app/controllers/api/v1/orders_controller.rb

  def index
    authenticate_user
    unless @current_user
      render json: { error: 'Authentication required' }, status: :unauthorized
      return
    end

    @orders = @current_user.orders.includes(:order_items, :products)
---
SELECT `order_items`.* FROM `order_items` WHERE `order_items`.`order_id` IN (5, 6)
SELECT `orders`.* FROM `orders` WHERE `orders`.`user_id` = 17
SELECT `products`.`id` FROM `products` WHERE `products`.`user_id` = 24

  def show
    authenticate_user
    unless @current_user
      render json: { error: 'Authentication required' }, status: :unauthorized
      return
    end

    @order = @current_user.orders.includes(:order_items, :products).find(params[:id])
---
SELECT `orders`.* FROM `orders` WHERE `orders`.`user_id` = 23 AND `orders`.`id` = NULL LIMIT 1

  def create
    authenticate_user
    unless @current_user
      render json: { error: 'Authentication required' }, status: :unauthorized
      return
    end

    # Calculate total amount from order items
    total_amount = 0
    order_items_data = params[:order][:order_items] || []

    order_items_data.each do |item_data|
      product = Product.find(item_data[:product_id])
      quantity = item_data[:quantity].to_i
      price = product.price
      total_amount += price * quantity
    end

    @order = @current_user.orders.build(
      status: 'pending',
      total_amount: total_amount,
      shipping_address: params[:order][:shipping_address],
      billing_address: params[:order][:billing_address] || params[:order][:shipping_address]
    )

    if @order.save
      # Create order items
      order_items_data.each do |item_data|
        product = Product.find(item_data[:product_id])
        quantity = item_data[:quantity].to_i
        price = product.price

        @order.order_items.create!(
          product: product,
          quantity: quantity,
          price: price
        )

        # Update product stock
        product.update!(stock_quantity: product.stock_quantity - quantity)
      end

      # Notify sellers about the order
      @order.order_items.each do |item|
        seller = item.product.user
        seller.notifications.create!(
          title: "New Order Received!",
          message: "Someone just ordered your #{item.product.title}",
          notification_type: "order",
          read: false
        )
---
SELECT `order_items`.* FROM `order_items` WHERE `order_items`.`order_id` = 5
SELECT `products`.* FROM `products` WHERE `products`.`id` = 13 LIMIT 1
INSERT INTO `orders` (`status`, `total_amount`, `shipping_address`, `billing_address`, `user_id`, `created_at`, `updated_at`) VALUES ('pending', 199.99, '123 Test St, City, State 12345', '123 Test St, City, State 12345', 17, '2025-08-01 19:07:21.572785', '2025-08-01 19:07:21.572785')
INSERT INTO `order_items` (`quantity`, `price`, `order_id`, `product_id`, `created_at`, `updated_at`) VALUES (1, 199.99, 5, 13, '2025-08-01 19:07:21.581958', '2025-08-01 19:07:21.581958')
UPDATE `products` SET `products`.`stock_quantity` = 14, `products`.`updated_at` = '2025-08-01 19:07:21.588995' WHERE `products`.`id` = 13
SELECT `order_items`.* FROM `order_items` WHERE `order_items`.`order_id` = 7
INSERT INTO `notifications` (`user_id`, `title`, `message`, `notification_type`, `read`, `created_at`, `updated_at`) VALUES (24, 'New Order Received!', 'Someone just ordered your Wireless Bluetooth Headphones', 'order', FALSE, '2025-08-02 08:58:09.024170', '2025-08-02 08:58:09.024170')

  def destroy
    authenticate_user
    unless @current_user
      render json: { error: 'Authentication required' }, status: :unauthorized
      return
    end

    @order = @current_user.orders.find(params[:id])

    # Restore product stock if order is cancelled
    if @order.status == 'pending'
      @order.order_items.each do |item|
---
SELECT `orders`.* FROM `orders` WHERE `orders`.`user_id` = 7

  def seller_orders
    authenticate_user
    unless @current_user
      render json: { error: 'Authentication required' }, status: :unauthorized
      return
    end

    # Find orders that contain products sold by the current user
    seller_product_ids = @current_user.products.pluck(:id)
    @orders = Order.includes(:order_items, :user)
                   .where(order_items: { product_id: seller_product_ids })
                   .distinct
---
SELECT `products`.`id` FROM `products` WHERE `products`.`user_id` = 24
SELECT `order_items`.* FROM `order_items` WHERE `order_items`.`order_id` IN (9, 10)