backend/app/controllers/api/v1/admin/admin_controller.rb

SELECT SUM(`orders`.`total_amount`) FROM `orders` WHERE `orders`.`status` = 'delivered'
SELECT `orders`.* FROM `orders` ORDER BY `orders`.`created_at` DESC LIMIT 10
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (23, 25)
SELECT `order_items`.* FROM `order_items` WHERE `order_items`.`order_id` IN (11, 10, 9, 8)
SELECT `products`.* FROM `products` ORDER BY `products`.`created_at` DESC
---
  def dashboard
    @stats = {
      total_users: User.count,
      total_products: Product.count,
      total_orders: Order.count,
      total_revenue: Order.where(status: 'delivered').sum(:total_amount)
    }

    @recent_orders = Order.includes(:user, :order_items).order(created_at: :desc).limit(10)
    @recent_users = User.order(created_at: :desc).limit(10)
    @recent_products = Product.includes(:user).order(created_at: :desc).limit(10)

SELECT `orders`.* FROM `orders` ORDER BY `orders`.`created_at` DESC
SELECT `users`.* FROM `users` ORDER BY `users`.`created_at` DESC
---
  def users
    @users = User.order(created_at: :desc)

SELECT `users`.* FROM `users` WHERE `users`.`id` = 23 LIMIT 1
---
  def toggle_admin
    @user = User.find(params[:id])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 23 LIMIT 1
---
  def delete_user
    @user = User.find(params[:id])

SELECT `orders`.* FROM `orders` ORDER BY `orders`.`created_at` DESC
SELECT `products`.* FROM `products` ORDER BY `products`.`created_at` DESC
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (28, 27, 26, 25, 24)
---
  def products
    @products = Product.includes(:user).order(created_at: :desc)

SELECT `products`.* FROM `products` WHERE `products`.`id` = 29 LIMIT 1
---
  def delete_product
    @product = Product.find(params[:id])

SELECT `order_items`.* FROM `order_items` WHERE `order_items`.`order_id` IN (10, 9, 8)
SELECT `orders`.* FROM `orders` ORDER BY `orders`.`created_at` DESC
SELECT `users`.* FROM `users` ORDER BY `users`.`created_at` DESC
---
  def orders
    @orders = Order.includes(:user, :order_items).order(created_at: :desc)